In [1]:
import sqlite3

In [3]:
cn = sqlite3.connect('cis660.db')

In [4]:
cr = cn.cursor()

In [5]:
cr.execute('''CREATE TABLE stocks 
              (date text, 
              trans text, symbol text, 
              qty real, 
              price real)''')

In [6]:
cr.execute("INSERT INTO stocks VALUES\
           ('2006-01-05','BUY','RHAT',100,35.14)")
cn.commit()
cn.close()

In [7]:
cn = sqlite3.connect('cis660.db')
cr = cn.cursor()

In [8]:
data = cr.execute("select * from stocks")

for row in data:
  print(row)

('2006-01-05', 'BUY', 'RHAT', 100.0, 35.14)

In [9]:
cr.execute('''CREATE TABLE COMPANY
            (ID INT PRIMARY KEY     NOT NULL,
            NAME           TEXT    NOT NULL,
            AGE            INT     NOT NULL,
            ADDRESS        CHAR(50),
            SALARY         REAL);''')

In [10]:
cr.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (1, 'Paul', 32, 'California', 20000.00 )");

cr.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (2, 'Allen', 25, 'Texas', 15000.00 )");

cr.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )");

cr.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )");

In [11]:
cn.commit()

In [12]:
data = cr.execute("SELECT id, name, address, salary from COMPANY")

for row in data:
  print(row)
  #print(row[1], row[3])

(1, 'Paul', 'California', 20000.0)
(2, 'Allen', 'Texas', 15000.0)
(3, 'Teddy', 'Norway', 20000.0)
(4, 'Mark', 'Rich-Mond ', 65000.0)

In [13]:
cr.execute("update company set Salary = 40000 where name='Paul'")
cn.commit()

In [14]:
cr.execute("delete from company where name='Paul'")
cn.commit()